### Import super awesome  `sqlite3_helper` module

In [1]:
import sqlite3_helper as sql3

### Create Connection

In [2]:
conn = sql3.create_connection('titanic.sqlite3', verbose=True)

Using SQLite version: 2.6.0
Creating Connection to titanic.sqlite3...

### Print all tables in database

In [3]:
tables = sql3.get_sql_tables(conn, verbose=True)

-------------- TABLES IN SQLITE3 DATABASE --------------
('titanic',)

### Get table metadata (i.e. PRAGMA)

In [4]:
titanic_info = sql3.get_table_info(conn, 'titanic', verbose=True)

-------------- COLUMN INFO FOR titanic --------------
cid            name           type           notnull        dflt_value     pk
0              id             INTEGER        0                             0
1              Survived       INTEGER        0                             0
2              Pclass         INTEGER        0                             0
3              Name           TEXT           0                             0
4              Sex            TEXT           0                             0
5              Age            REAL           0                             0
6              Siblings/Spouses AboardINTEGER        0                             0
7              Parents/Children AboardINTEGER        0                             0
8              Fare           REAL           0                             0

### Do any SELECT query you like

In [5]:
query = 'SELECT * FROM titanic LIMIT 10;'
results = sql3.select_query(conn, query, verbose=True)

(0, 0, 3, 'Mr. Owen Harris Braund', 'male', 22.0, 1, 0, 7.25)
(1, 1, 1, 'Mrs. John Bradley (Florence Briggs Thayer) Cumings', 'female', 38.0, 1, 0, 71.2833)
(2, 1, 3, 'Miss. Laina Heikkinen', 'female', 26.0, 0, 0, 7.925)
(3, 1, 1, 'Mrs. Jacques Heath (Lily May Peel) Futrelle', 'female', 35.0, 1, 0, 53.1)
(4, 0, 3, 'Mr. William Henry Allen', 'male', 35.0, 0, 0, 8.05)
(5, 0, 3, 'Mr. James Moran', 'male', 27.0, 0, 0, 8.4583)
(6, 0, 1, 'Mr. Timothy J McCarthy', 'male', 54.0, 0, 0, 51.8625)
(7, 0, 3, 'Master. Gosta Leonard Palsson', 'male', 2.0, 3, 1, 21.075)
(8, 1, 3, 'Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson', 'female', 27.0, 0, 2, 11.1333)
(9, 1, 2, 'Mrs. Nicholas (Adele Achem) Nasser', 'female', 14.0, 1, 0, 30.0708)